commons/ihe/hl7v2ws/src/main/resources/wsdl/pcd01/pcd01-raw.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--
  ~ Copyright 2011 the original author or authors.
  ~
  ~ Licensed under the Apache License, Version 2.0 (the "License");
  ~ you may not use this file except in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~     http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing, software
  ~ distributed under the License is distributed on an "AS IS" BASIS,
  ~ WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  ~ See the License for the specific language governing permissions and
  ~ limitations under the License.
  -->
<definitions name="DeviceObservationConsumer"
             xmlns="http://schemas.xmlsoap.org/wsdl/"
             targetNamespace="urn:ihe:pcd:dec:2010"
             xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
             xmlns:ihe="urn:ihe:pcd:dec:2010">
    
    <documentation>IHE PCD Device Observation Consumer = PCD-01 adaptor = Communicate PCD Data</documentation>

    <types>
        <xsd:schema elementFormDefault="qualified" targetNamespace="urn:ihe:pcd:dec:2010">
            <xsd:element name="rawData" type="xsd:anyType"/>
        </xsd:schema>
    </types>

    <message name="CommunicatePCDData_Message">
        <documentation>Communicate PCD Data</documentation>
        <part name="Body" element="ihe:rawData"/>
    </message>

    <message name="CommunicatePCDDataResponse_Message">
        <documentation>Communicate PCD Data Response</documentation>
        <part name="Body" element="ihe:rawData"/>
    </message>

    <portType name="DeviceObservationConsumer_PortType">
        <operation name="CommunicatePCDData">
            <input message="ihe:CommunicatePCDData_Message"
                   wsam:Action="urn:ihe:pcd:2010:CommunicatePCDData"/>
            <output message="ihe:CommunicatePCDDataResponse_Message"
                    wsam:Action="urn:ihe:pcd:2010:CommunicatePCDDataResponse"/>
        </operation>
    </portType>

    <binding name="DeviceObservationConsumer_Binding_Soap12" type="ihe:DeviceObservationConsumer_PortType">
        <soap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="CommunicatePCDData">
            <soap12:operation soapAction="urn:ihe:pcd:2010:CommunicatePCDData" soapActionRequired=""/>
            <input>
                <soap12:body use="literal"/>
            </input>
            <output>
                <soap12:body use="literal"/>
            </output>
        </operation>
    </binding>

    <service name="DeviceObservationConsumer_Service">
        <port name="DeviceObservationConsumer_Port_Soap12" binding="ihe:DeviceObservationConsumer_Binding_Soap12">
            <soap12:address location="http://servicelocation/pcd01"/>
        </port>
    </service>
</definitions>